Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: We explicitly pass it through parse:
en: We explicitly pass it through the parse:

source: We have to manually make calls depending on argument length here
en: We have to manually make calls depending on length argument here

source: 6-digit extended year
en: 6-digit year extended

source: Test for NaN and round fractionDigits down
en: Test for NaN and round down fractionDigits

source: ECMA-262, 3rd B.2.3 Note an ECMAScript standart, although ECMAScript 3rd Edition has a non-normative section suggesting uniform semantics and it should be normalized across all browsers [bugfix, IE lt 9] IE < 9 substr() with negative value not working in IE
en: ECMA-262, 3rd B. 2.3 Note an ECMAScript standard, although ECMAScript 3rd Edition has a non-normative section suggesting uniform semantics and it should be normalized across all browsers [bugfix, lt IE 9] IE < 9 substr() with negative value not working in IE

source: @param {Object} model Модель мультимаршрута. Задается объектом с полями: referencePoints - описание опорных точек мультимаршрута (обязательное поле); params - параметры маршрутизации.
en: @param {Object} model The model of a multiroute. It is defined by an object with fields: referencePoints - a description of the multiroute reference points (mandatory field); params - routing parameters.

source: Функция устанавливает параметры маршрутизации.
en: The function sets the routing parameters.

source: Тип маршрутизации - на общественном транспорте.
en: Type of routing - on public transport.

source: Тип маршрутизации - на автомобиле.
en: Type of routing - by car.

source: Для того чтобы построить маршрут на общественном транспорте, необходимо передать в параметрах маршрутизации поле routingMode: 'masstransit'. По умолчанию при создании мультимаршрута данное поле принимает значение 'auto' (на автомобиле).
en: In order to build a route on public transport, you need to pass the routingMode: 'masstransit' field in the route parameters. By default, when creating a multiroute, this field is set to 'auto' (by car).

source: Подробнее о параметрах и опциях мультимаршрутизатора описано в примере Построение мультимаршрута.
en: For more information about multiroute parameters and options, see the example Planning a multiroute.

source: Провайдер ищет по полю text стандартным методом String.ptototype.indexOf.
en: The provider searches the "text" field using the standard method String.ptototype.indexOf.

source: Сколько результатов нужно пропустить.
en: How many results to skip.

source: Количество возвращаемых результатов.
en: The number of results to return.

source: При формировании ответа можно учитывать offset и limit.
en: When forming the response, "offset" and "limit" can be taken into account.

source: Добавляем точки в результирующую коллекцию.
en: Adding points to the resulting collection.

source: Геообъекты поисковой выдачи.
en: Geo objects in search results.

source: Метаинформация ответа.
en: Response metainformation.

source: Строка обработанного запроса.
en: String with the processed request.

source: Количество найденных результатов.
en: The number of found results.

source: Количество возвращенных результатов.
en: The number of returned results.

source: Количество пропущенных результатов.
en: The number of skipped results.

source: Возвращаем объект-обещание.
en: Returning a promise object.

source: Добавляем коллекцию меток на карту.
en: Adding a collection of placemarks to the map.

source: Заполняем коллекцию данными.
en: Populating the collection with data.

source: Заменяем стандартный провайдер данных (геокодер) нашим собственным.
en: Replacing the standard data provider (geocoder) with our own.

source: Не будем показывать еще одну метку при выборе результата поиска, т.к. метки коллекции myCollection уже добавлены на карту.
en: We won't show another placemark when selecting a search result, because the placemarks in the myCollection collection have already been added to the map.

source: По полю skip определяем, что это не дозагрузка данных. По getRusultsCount определяем, что есть хотя бы 1 результат.
en: The "skip" field indicates that this is not data uploading. The "getRusultsCount" field shows that there is at least 1 result.

source: Создаем карту.
en: Creating the map.

source: Содержимое хинта.
en: The contents of the hint.

source: Часто возникает задача проложить маршрут между заданными точками, а затем проанализировать, в какие области или города попадают сегменты этого маршрута. В данном примере по заранее подготовленным данным создается многоугольник, описывающий МКАД. После получения маршрута делается проверка на попадание его сегментов в этот многоугольник с помощью метода searchInside.
en: It is often necessary to draw a route between specified points, and then analyze in what areas or cities the segments of this route fall on. In this example, prepared data is used for creating a polygon defining the MKAD. After the route is received, a check is performed for whether its segments fall within this polygon using the method searchInside.

source: С помощью объекта [#$dp12] можно задавать опции или данные сразу группе геообъектов. Здесь показано, как сегменты маршрута, лежащие внутри и снаружи кольцевой автодороги, раскрашиваются в разные цвета.
en: Using the [#$dp12] object, you can set options or data for a group of geo objects at once. As shown here, the route segments that lie inside and outside the ring road are drawn in different colors.

source: Фильтр по цветам Красные Зеленые Желтые
en: Filter by color Red Green Yellow

source: Фильтр по геометриям Точки Многоугольники Круги
en: Filter by geometry Points Polygons Circles

source: Макеты объектов можно создавать с помощью фабрики [#$dp8], используя текcтовые шаблоны.
en: Layouts can be created using the [#$dp8] factory using text templates.

source: В данном примере создается пользовательский макет элемента управления масштабом карты. Макет элемента управления строится на основе его данных, состояния и опций. Макет автоматически перестраивается при изменении значений полей, состояния или опций, которые используются в его текстовом шаблоне.
en: This example creates a custom layout for the map zoom control. The layout of the control is based on its data, status, and options. The layout is automatically rebuilt when changes are made to the values of fields, states, or options that are used in its text template.

source: В ответ на действия пользователя (клик мышкой по кнопке) макет может генерировать специальные события, описанные в его интерфейсе. Элемент управления слушает эти события на макете и пытается изменить свое состояние, данные или опции. После того, как элемент управления осуществил изменения, макет перестраивается на основе обновленных данных.
en: In response to a user action (a mouse click on the button), the layout can generate special events that are defined in its interface. The control listens to these events on the layout and tries to change its state, data, or options. After the control has implemented changes, the layout is rebuilt based on the updated data.

source: Список событий, на которые реагирует ползунок маштаба, описан в интерфейсе [#$dp16].
en: The list of events that the zoom slider responds to is provided in the [#$dp16] interface.

source: Макеты объектов можно создавать с помощью фабрики [#$dp9], используя текcтовые шаблоны.
en: Layouts of objects can be created using the [#$dp9] factory, using text templates.

source: В данном примере создается адаптивный пользовательский макет кнопки. Макет элемента управления строится на основе его данных, состояния и опций.
en: This example creates an adaptive custom button layout. The layout of the control is based on its data, status, and options.

source: Макет автоматически перестраивается при изменении значений полей, состояния или опций, которые используются в его текстовом шаблоне.
en: The layout is automatically adjusted when changes are made to the values of fields, states, or options that are used in its text template.

source: Устанавливаем размеры макета контента балуна (в пикселях).
en: Setting the size of the balloon content layout (in pixels).

source: В примере используется макет балуна кластера "cluster#balloonAccordion". В макете выводится список геообъектов, а после клика по элементу происходит отображение информации о геообъекте. Информация о выбранном геообъекте задается отдельным макетом и может быть настроена при помощи опции 'clusterBalloonItemContentLayout'. В данном примере задается собственный макет с информацией о геообъекте. Макеты объектов можно создавать с помощью фабрики [#$dp10], используя текcтовые шаблоны. Текстовые шаблоны формируют html-содержимое макета на основе хэша с данными, передаваемого в конструктор макета. В данном примере поставщик данных - это геообъект.
en: The example uses the layout of the cluster balloon "cluster#balloonAccordion". The layout outputs a list of geo objects, and after clicking on an item, information is displayed about the geo object. Information about the selected geo object is defined as a separate layout and can be configured using the option 'clusterBalloonItemContentLayout' option. This example defines a custom layout with information about the geo object. Layouts can be created using the [#$dp10] factory using text templates. Text templates generate HTML content based on a hash with data that is passed to the layout constructor. In this example, the data provider is a geo object.

source: В примере показано, как создавать собственные элементы управления. Класс элемента управления должен реализовывать интерфейс IControl.
en: The example shows how to create custom controls. The control class must implement the IControl interface.

source: Для ускорения разработки, можно отнаследовать класс элемента управления от класса collection.Item.
en: To speed development, you can inherit the control class from the collection.Item class.

source: В данном примере на карту добавлена метка, при клике на которой открывается балун-панель с заданным содержимым.
en: In this example, a placemark is added to the map that, when clicked, opens a balloon panel with the specified content.

source: Для задания стиля метки из набора встроенных стилей используется опция preset. В API предустановлено пять различных стилей для меток (в скобках указаны соответствующие ключи):
en: To set the placemark style from a set of built-in styles, use the preset option. The API has five preset styles for placemarks (the corresponding keys are shown in parentheses):

source: Для каждого стиля на выбор предоставлено 16 цветов. API позволяет задавать меткам также собственные цвета для всех стилей, кроме 'islands#stretchyIcon'. Как задавать меткам собственные цвета см. в следующем примере.
en: For each style there are 16 colors. The API allows you to also specify custom colors for placemarks for all styles, except 'islands#stretchyIcon'. For information on how to set custom colors for placemarks, see the following example.

source: Опции запроса
en: Request options

source: Примеры. TEMPLATE TITLE
en: Examples. TEMPLATE TITLE

source: Данный пример демонстрирует, как создать карту, изначально отцентрированную по местоположению пользователя.
en: This example demonstrates how to create a map that is initially centered on the user's location.

source: Для определения местоположения используется метод get функции geolocation. В его параметрах можно указать предпочтительный способ определения местоположения (по IP или с помощью Geolocation API), время ожидание ответа и др. Подробнее см. в описании метода.
en: The "get" method of the geolocation function is used for detecting the location. In the parameters, you can set the preferred method of location detection (by IP or using the Geolocation API), the time to wait for a response, and so on. For more information, see the description of the method.

source: При вызове данного метода браузер пытается определить географическое положение пользователя. В случае успеха результат записывается в поле карты geoObjects, в противном случае возникает сообщение об ошибке.
en: When calling this method, the browser tries to determine the geographical position of the user. If successful, the result is written in the geoObjects map field; otherwise, there is an error message.

source: В данном примере, если местоположение определить не удалось, создается карта с центром в Москве.
en: In this example, if the location cannot be detected, a map is created with the center in Moscow.

source: В примере показано, как на основе класса линии [#$dp6] создать модуль для рисования стрелок на карте.
en: The example shows how to create a module based on the [#$dp6] line class for drawing arrows on the map.

source: В примере создаются два пользовательских модуля - один отвечает за класс объекта-стрелки, второй модуль включает в себя визуальное отображение стрелки - класс, реализующий интерфейс [#$dp9]. В примере модули располагаются в одном файле. При разработке проекта рекомендуется помещать модули в отдельные файлы.
en: The example creates two custom modules - one is responsible for the arrow object class, and the second module includes a visual display of the arrow - a class that implements the [#$dp9] interface. In the example, the modules are located in the same file. During project development, it is recommended to place the modules in separate files.

source: Кластеризатор реализуется классом [#$dp11]. В качестве параметров конструктору можно передать опции кластеризатора: стиль отображения значка кластера, размер его ячейки и т. д. Список доступных опций можно посмотреть в соответствующем разделе справочника.
en: Clusterization is implemented by the [#$dp11] class. As parameters to the constructor, you can pass clusterer options: the style for displaying the cluster icon, the size of its cell, and so on. For the list of available options, see the relevant section of the reference guide.

source: В примере показано, как изменить цвет иконки или кластера при наведении.
en: The example shows how to change the color of the icon or cluster on mouse hover.

source: Каждый элемент управления реализуется отдельным классом из пространства имен control (например, control.TrafficControl). Ссылка на элементы управления содержится в поле controls карты. Для добавления или удаления элемента управления используются методы add и remove соответственно.
en: Each control is implemented by a separate class from the control namespace (e.g. control.TrafficControl). The reference to the controls is contained in the controls field of the map. To add or remove a control, use the "add" and "remove" methods, respectively.

source: В API 2.1 добавлять элементы управления на карту можно также через ее параметры. Это означает, что при инициализации карты в поле controls можно указать ключ соответствующего элемента управления.
en: In the API 2.1, controls can also be added to the map through its parameters. This means that when you initialize the map, you can specify the key of the corresponding control in the "controls" field.

source: Добавлять можно как отдельные элементы управления, так и сразу их набор. В API 2.1 встроено три стандартных набора элементов управления, доступные по следующим ключам:
en: You can add individual controls, or an entire set at once. The API 2.1 has three standard sets of controls available using the following keys:

source: Наборы отличаются количеством входящих в них элементов управления, а также размером соответствующих кнопок. В зависимости от размеров карты может быть добавлен тот или иной набор. При создании карты автоматически добавляется набор 'mediumMapDefault'. Однако, если карта достаточно больших размеров, то целесообразно добавить 'largeMapDefaultSet'. Если при изменении размеров карты элементы управления не будут помещаться на карте, API автоматически уменьшит их иконки.
en: The sets differ in the number of controls included in them, as well as the size of the buttons. A set can be added depending on the size of the map. When the map is created, the 'mediumMapDefault' set is added automatically. However, if the map is fairly large, it is advisable to add 'largeMapDefaultSet'. If controls will not fit on the map when it is resized, the API will automatically reduce the size of icons.

source: Подробнее о доступных наборах элементов управления см. в справочнике.
en: For more information about the available sets of controls, see the reference guide.

source: Примеры. Собственное изображение иконок меток мультимаршрута
en: Examples. Custom placemark icon image for a multiroute

source: Иконкам меток мультимаршрутизатора можно задавать собственные изображения.
en: Icons for multirouter placemarks can be set to custom images.

source: Чтобы установить нужное изображение, задайте для метки следующие опции:
en: To set a desired image, specify the following options for the placemark:

source: Обратите внимание, что опции должны быть указаны с префиксами. Например, если задаются опции для путевых точек, нужно использовать префикс wayPoint, для транзитных - viaPoint. Для стартовой и конечной точек маршрута используются префиксы wayPointStart и wayPointFinish соответственно.
en: Please note that options must be specified with prefixes. For example, if you set the options for waypoints, you need to use the wayPoint prefix, or the viaPoint prefix for a throughpoint. For the start and end points of the route, use the prefixes wayPointStart and wayPointFinish, respectively.

source: Также могут быть установлены опции iconImageSize (ширина и высота изображения в пикселях), iconImageOffset (сдвиг левого верхнего угла иконки относительно точки привязки) и iconImageClipRect (координаты отображаемой области исходного изображения в пикселях).
en: You can also set the options iconImageSize (width and height of the image in pixels), iconImageOffset (offset of the upper left corner of the icon relative to the anchor point), and iconImageClipRect (coordinates of the visible area of the original image in pixels).

source: Макет геообъекта.
en: Geo object layout.

source: При добавлении большого числа меток на карту их кластеризация позволяет избежать большой потери производительности браузера при их отображении.
en: When adding a large number of placemarks to the map, clustering them helps avoid a large loss in browser performance when displaying them.

source: Для сравнения в данном примере на карту можно добавить метки, объединенные как в кластеры, так и в обычные коллекции.
en: For comparison, in this example, you can add placemarks to the map both combined in clusters and in regular collections.

source: Часто при работе с картой приходится загружать большой объем дополнительных данных (текстовая информация, картинки и пр.). При этом загруженная информация не всегда используется пользователем. Например, когда на карте отображены сотни меток, и балун каждой из них содержит большой объем текста. При работе с картой пользователь может не открыть ни один балун, но данные все равно будут загружены.
en: Often when working with the map you have to download a large amount of additional data (text information, images, etc). However, this downloaded information is not always used by the user. For example, when the map display hundreds of placemarks, and each of them has a balloon containing a large amount of text. When working with the map, the user might not open any of the balloons, but the data will still be loaded.

source: В таких случаях в целях экономии трафика имеет смысл загружать данные не сразу, а по мере необходимости.
en: In such cases, in order to save traffic it makes sense to not load data immediately, but wait until it is needed.

source: Данный пример демонстрирует динамическую загрузку содержимого балуна с помощью AJAX-запроса.
en: This example demonstrates how to dynamically load the contents of a balloon using an AJAX request.

source: При клике на значок кластера или одиночной метки производится проверка, загружено ли содержимое их балуна. Если для каких-либо меток текст балуна не задан, серверу отправляется POST-запрос с массивом идентификаторов этих меток. Сервер обрабатывает массив и на его основе возвращает JSON-объект, содержащий необходимые данные.
en: When a cluster icon or a separate placemark is clicked, a check is performed for whether the balloon content is loaded. If any placemarks do not have the balloon text specified, a POST request is sent to the server with an array of identifiers of these placemarks. The server processes the array and returns a JSON object based on it containing the required data.

source: Обратите внимание, что серверную часть необходимо реализовать самостоятельно.
en: Note that you need to implement the server side yourself.

source: Бывают случаи, когда необходимо ограничить видимую область карты, чтобы у пользователей не было возможности выйти за её пределы.
en: Sometimes it is necessary to limit the visible area of the map, so users cannot go beyond it.

source: Для таких случаев у карты есть опция «restrictMapArea», которая может принимать в качестве входных параметров прямоугольную область, либо булево значение. В случае «true» пользователь не сможет выйти за пределы изначальной видимой области карты.
en: For such cases, the map has the "restrictMapArea" option, which can take as input parameters a rectangular area, or a Boolean value. If "true" the user will not be able to go beyond the initial visible area of the map.

source: С подробным описанием опции можно ознакомиться здесь.
en: For a detailed description of the options, see this section.

source: Если недостаточно просто ограничить область просмотра прямоугольником и необходимо решить более сложную задачу (например, запретить центру карты выходить за пределы какого-либо полигона), то с помощью map.action.Manager.setCorrection, можно задать функцию, которая будет корректировать действия пользователя на карте.
en: If it is not enough simply to limit the viewport to a rectangle and you have a more complex task (for example, to prevent the center of the map from going outside of a polygon), use map.action.Manager.setCorrection to specify a function that will adjust the actions of the user on the map.

source: Описываем геометрию геообъекта.
en: Describing the geometry of the geo object.

source: Указываем координаты вершин ломаной.
en: Specifying the coordinates of the vertices of the polyline.

source: Описываем свойства геообъекта.
en: Defining properties of the geo object.

source: Содержимое балуна.
en: The contents of the balloon.

source: Цвет линии.
en: The line color.

source: Описываем свойства геообъекта. Содержимое балуна.
en: Describing the properties of the geo object. The contents of the balloon.

source: Мультимаршрутизатор позволяет по заданным точкам строить сразу несколько маршрутов.
en: The multirouter allows planning multiple routes at once using the set points.

source: Для создания мультимаршрута используется класс [#$dp7]. В качестве его параметров передаются следующие объекты:
en: To create a multiroute, use the [#$dp7] class. The following objects are passed as its parameters:

source: модель мультимаршрута. Задается в качестве объекта с полями:
en: The multiroute model. It is defined as an object with fields:

source: referencePoints - массив опорных точек маршрута. Обратите внимание, что если задано больше двух опорных точек, то маршрутизатор возвращает только один маршрут.
en: referencePoints - an array of reference points on the route. Note that if more than two points are set, the router returns only one route.

source: params - параметры маршрутизации (например, тип маршрутизации, учитывать ли трафик и др.).
en: params - the routing parameters (for example, the routing type, whether to consider traffic, and so on).
